class Account < ActiveRecord::Base
  belongs_to :user
  has_many :transactions, :dependent => :destroy
  has_many :rules, :dependent => :destroy

  validates :title, :length => { :minimum => 3, :maximum=>15 }, :uniqueness => true
  validates_inclusion_of :currency, :in => ["AED",   "ARS",    "ATS",    "AUD",    "BEF",    "BHD",    "BOB",    "BRL",    "CAD",    "CHF",    "CLP",    "CNY",   "CZK",    "DEM",    "DKK",    "EGP",    "ESP",    "EUR",    "FIM",    "FJD",    "FRF",    "GBP",    "GRD",    "HKD",    "IDR",    "IEP",    "ILS",    "INR",    "ITL",    "JMD",    "JPY",    "KRW",    "KWD",    "LKR",    "MXN",    "MYR",    "NLG",    "NOK",    "NPR",    "NZD",    "PAB",    "PGK",    "PHP",    "PKR",    "PTE",    "RUR",    "SAR",    "SBD",    "SEK",    "SGD",    "THB",    "TOP",    "TRL",    "TWD",    "USD", "VUV", "ZAR"]
  validates_numericality_of :balance, :greater_than => 0

  def self.currency_hash
    {
    "AED" => " дирхам - ОАЭ",
    "ARS" => " песо - Аргентина ",
    "ATS" => " шиллинг - Австрия ",
    "AUD" => " доллар - Австралия ",
    "BEF" => " франк - Бельгия ",
    "BHD" => " динар - Бахрейн ",
    "BOB" => " боливьяно - Боливия",
    "BRL" => " реал - Бразилия ",
    "CAD" => " доллар - Канада ",
    "CHF" => " франк - Швейцария",
    "CLP" => " песо -Чили ",
    "CNY" => " юань - Китай",
    "CZK" => " крона - Чехия",
    "DEM" => " немецкая марка - Германия ",
    "DKK" => " крона - Дания ",
    "EGP" => " фунт - Египет ",
    "ESP" => " песета - Испания",
    "EUR" => " евро ",
    "FIM" => " марка - Финляндия ",
    "FJD" => " доллар - Фиджи ",
    "FRF" => " франк - Франция ",
    "GBP" => " фунт стерлинга ",
    "GRD" => " драхма - Греция ",
    "HKD" => " доллар - Гонконг ",
    "IDR" => " рупия - Индонезия ",
    "IEP" => " фунт - Ирландия ",
    "ILS" => " шекель - Израиль ",
    "INR" => " рупия - Индия ",
    "ITL" => " лира - Италия ",
    "JMD" => " доллар - Ямайка",
    "JPY" => " иена - Япония ",
    "KRW" => " вон - Южная Корея",
    "KWD" => " динар - Кувейт ",
    "LKR" => " рупия - Шри-Ланка",
    "MXN" => " песо - Мексика ",
    "MYR" => " ринггит - Малайзия",
    "NLG" => " гульден - Нидерланды",
    "NOK" => " крона - Норвегия ",
    "NPR" => " рупия - Непал ",
    "NZD" => " доллар - Новая Зеландия ",
    "PAB" => " бальбоа - Панама ",
    "PGK" => " кина  - Папуа Новая Гвинея",
    "PHP" => " песо - Филиппины ",
    "PKR" => " рупия - Пакистан ",
    "PTE" => " эскудо - Португалия",
    "RUR" => " рубль - Россия ",
    "SAR" => " риял - Сайдовская Аравия ",
    "SBD" => " доллар  Соломоновы острова",
    "SEK" => " крона - Швеция ",
    "SGD" => " доллар - Сингапур",
    "THB" => " бат - Таиланд ",
    "TOP" => " паанга - Тоонго",
    "TRL" => " лира - Турция ",
    "TWD" => " доллар - Новый Тайвань",
    "USD" => " доллар - США ",
    "VUV" => " вату - Вануату",
    "ZAR" => " ранд - ЮАР"}
  end
end
